Repository: FandresenaR/tradegasy
Catalog: lib/l10n/app_*.arb
Languages: fr

# homeScreenTitle
source: Home
fr: Accueil

# marketScreenTitle
source: Market
fr: Marché

# settingsScreenTitle
source: Settings
fr: Paramètres

source: Dark Mode
fr: Mode sombre

# darkModeDescription
source: Switch between light and dark theme
fr: Basculer entre thème clair et sombre

source: Language
fr: Langue

# languageDescription
source: Change application language
fr: Changer la langue de l'application

source: English
fr: Anglais

source: French
fr: Français

source: API Keys
fr: Clés API

# apiKeysDescription
source: Configure Binance and OpenRouter keys
fr: Configurer les clés Binance et OpenRouter

source: API Diagnostic
fr: Diagnostic API

# apiDiagnosticDescription
source: Check and fix API connection issues
fr: Vérifier et résoudre les problèmes de connexion API

source: Help Center
fr: Centre d'aide

# helpCenterDescription
source: FAQ and user guides
fr: FAQ et guides d'utilisation

source: About TradeGasy
fr: À propos de TradeGasy

source: Profile
fr: Profil

source: Edit Profile
fr: Modifier le profil

source: Binance API Key
fr: Clé API Binance

# binanceApiKeyDescription
source: Required for accessing real-time market data
fr: Nécessaire pour accéder aux données de marché en temps réel

source: Binance Secret Key
fr: Clé secrète Binance

# binanceSecretKeyDescription
source: Required for authentication with Binance API
fr: Nécessaire pour l'authentification avec l'API Binance

source: OpenRouter API Key
fr: Clé API OpenRouter

# openRouterApiKeyDescription
source: For DeepSeek R1 AI market analysis
fr: Pour l'analyse de marché IA avec DeepSeek R1

source: Hugging Face API Key
fr: Clé API Hugging Face

# huggingFaceApiKeyDescription
source: Alternative AI service for market analysis
fr: Service IA alternatif pour l'analyse de marché

source: Replicate API Key
fr: Clé API Replicate

# replicateApiKeyDescription
source: Alternative AI service for market analysis
fr: Service IA alternatif pour l'analyse de marché

source: Chart
fr: Graphique

source: AI Analysis
fr: Analyse IA

# askAboutChart
source: Ask about this chart...
fr: Interroger ce graphique...

# analyzingChart
source: Analyzing chart data...
fr: Analyse des données en cours...

# selectQuestion
source: Select a question
fr: Sélectionner une question

source: Refresh
fr: Actualiser

source: Try Again
fr: Réessayer

# selectAQuestion
source: Select a question about {symbol}
fr: Sélectionner une question à propos de {symbol}

# trendQuestion
source: What's the current trend for {symbol}?
fr: Quelle est la tendance actuelle pour {symbol}?

# supportResistanceQuestion
source: Identify key support and resistance levels
fr: Identifier les niveaux de support et résistance

# entryPointQuestion
source: Is this a good entry point for {symbol}?
fr: Est-ce un bon point d'entrée pour {symbol}?

# exitPositionQuestion
source: When should I exit this position?
fr: Quand devrais-je sortir de cette position?

# technicalIndicatorsQuestion
source: What technical indicators are most relevant now?
fr: Quels indicateurs techniques sont les plus pertinents actuellement?

# volumePatternQuestion
source: Explain the recent volume pattern
fr: Expliquer le modèle de volume récent

# marketSentimentQuestion
source: What's the market sentiment for {symbol}?
fr: Quel est le sentiment du marché pour {symbol}?

# bitcoinComparisonQuestion
source: How does this chart compare to Bitcoin?
fr: Comment ce graphique se compare-t-il au Bitcoin?

# noChartData
source: No chart data available
fr: Aucune donnée de graphique disponible

# errorRenderingChart
source: Error rendering chart: {error}
fr: Erreur d'affichage du graphique: {error}

# noCandleData
source: No candle data available for {symbol}
fr: Aucune donnée de chandelier disponible pour {symbol}

# noTradingPairs
source: No trading pairs available
fr: Aucune paire de trading disponible

# askDeepSeek
source: Ask DeepSeek R1 about the current chart
fr: Demandez à DeepSeek R1 à propos du graphique actuel

# exampleQuestion
source: Example: "What's the trend for {symbol}?" or "Identify support and resistance levels"
fr: Exemple: "Quelle est la tendance pour {symbol}?" ou "Identifier les niveaux de support et résistance"

# analysisCopied
source: Analysis copied to clipboard
fr: Analyse copiée dans le presse-papiers

source: Copy
fr: Copier

source: Save
fr: Enregistrer

source: Cancel
fr: Annuler

source: Configure
fr: Configurer

source: Update
fr: Mettre à jour

# configureApiKey
source: Configure {keyType}
fr: Configurer {keyType}

source: Save Changes
fr: Enregistrer les modifications

source: Save All Keys
fr: Enregistrer toutes les clés

source: Clear All Keys
fr: Effacer toutes les clés

source: Error
fr: Erreur

# errorLoadingData
source: Error loading data: {error}
fr: Erreur de chargement des données: {error}

# errorInitializingServices
source: Error initializing services: {error}
fr: Erreur d'initialisation des services: {error}

# waitingForServices
source: Waiting for services to initialize
fr: En attente de l'initialisation des services

# apiKeysSavedSuccess
source: API key saved successfully
fr: Clé API enregistrée avec succès

# pleaseEnterNewKey
source: Please enter a new key value
fr: Veuillez entrer une nouvelle valeur de clé

source: Not available
fr: Non disponible

source: Notifications coming soon
fr: Notifications bientôt disponibles

# pleaseWaitForServices
source: Please wait for services to initialize
fr: Veuillez attendre l'initialisation des services

source: Signals Summary
fr: Résumé des signaux

source: Active
fr: Actifs

source: Closed
fr: Clôturés

source: Success Rate
fr: Taux de réussite

source: Recent Signals
fr: Signaux récents

source: See All
fr: Voir tout

# generatedSignals
source: Generated {count} new signals
fr: {count} nouveaux signaux générés

# noNewSignals
source: No new signals found at this time
fr: Aucun nouveau signal trouvé pour le moment

# errorGeneratingSignals
source: Error generating signals: {error}
fr: Erreur lors de la génération des signaux: {error}

# errorRefreshingSignals
source: Error refreshing signals: {error}
fr: Erreur lors de l'actualisation des signaux: {error}

source: Signal Details
fr: Détails du signal

# shareFeature
source: Share feature coming soon
fr: Partage bientôt disponible

source: Price Levels
fr: Niveaux de prix

source: Entry
fr: Entrée

source: Take Profit
fr: Objectif

source: Closing Price
fr: Prix de clôture

source: Profit/Loss
fr: Profit/Perte

source: Signal Type
fr: Type de signal

source: Currency Pair
fr: Paire de devises

source: Entry Price
fr: Prix d'entrée

source: Take Profit Level
fr: Niveau d'objectif

source: Stop Loss Level
fr: Niveau de stop loss

source: Status
fr: Statut

source: Analysis Notes
fr: Notes d'analyse

source: Mark as Closed
fr: Marquer comme clôturé

source: Edit Signal
fr: Modifier le signal

# closeSignalFeature
source: Close signal feature coming soon
fr: Clôture de signal bientôt disponible

# editSignalFeature
source: Edit signal feature coming soon
fr: Modification de signal bientôt disponible

source: Active Signal
fr: Signal actif

source: Closed Signal
fr: Signal clôturé

source: Pending Signal
fr: Signal en attente

# signalId
source: Signal ID: {id}
fr: ID du signal: {id}

# createdAt
source: Created: {date}
fr: Créé le: {date}

source: BUY
fr: ACHAT

source: SELL
fr: VENTE

source: Time
fr: Heure

# signalPair
source: {pair} Details
fr: Détails de {pair}

# signalReason_macdBuy
source: MACD crossed above the signal line
fr: MACD a croisé au-dessus de la ligne de signal

# signalReason_rsiBuy
source: RSI exited the oversold zone
fr: RSI est sorti de la zone de survente

# signalReason_maBuy
source: Price is above moving averages
fr: Prix au-dessus des moyennes mobiles

# signalReason_volumeConfirmsBuy
source: Increasing volume confirms bullish movement
fr: Le volume en hausse confirme le mouvement haussier

# signalReason_macdSell
source: MACD crossed below the signal line
fr: MACD a croisé en dessous de la ligne de signal

# signalReason_rsiSell
source: RSI entered the overbought zone
fr: RSI est entré dans la zone de surachat

# signalReason_maSell
source: Price is below moving averages
fr: Prix en dessous des moyennes mobiles

# signalReason_volumeConfirmsSell
source: Decreasing volume indicates a weakening trend
fr: Diminution du volume indiquant un affaiblissement de la tendance

# signalNote_strongMomentum
source: Strong momentum with bullish trend
fr: Fort momentum avec tendance haussière

# signalNote_resistanceRejection
source: Resistance zone rejected price
fr: Zone de résistance a rejeté le prix

# signalNote_supportConfirmation
source: Waiting for confirmation at key support level
fr: En attente de confirmation au niveau de support clé

# signalNote_bearishContinuation
source: Bearish trend continuation pattern
fr: Pattern de continuation de tendance baissière
